Enums/СостоянияСогласованияВДокументообороте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СостоянияСогласованияВДокументообороте</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласованияВДокументообороте/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подбирает значение перечисления, соответствующее значению перечисления DMDocumentStatus из XDTO пакета DM.
//
// Параметры:
//   СтатусДО - Строка - статус документа в 1С:Документооборот.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СостоянияСогласованияВДокументообороте
//
Функция ЗначениеСоответствующееСтатусуДО(СтатусДО) Экспорт
	
	Результат = Перечисления.СостоянияСогласованияВДокументообороте.ПустаяСсылка();
	
	Если СтатусДО = "AwaitingApproval" Тогда
		Результат = Перечисления.СостоянияСогласованияВДокументообороте.НаСогласовании;
		
	ИначеЕсли СтатусДО = "Approved" Тогда
		Результат = Перечисления.СостоянияСогласованияВДокументообороте.Согласован;
		
	ИначеЕсли СтатусДО = "NotApproved" Тогда
		Результат = Перечисления.СостоянияСогласованияВДокументообороте.НеСогласован;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
